{"Declaration": "I do here by declare that at all the information furnished above are true,complete and correct to the best of my knowledge and belief", "Experience": {"Assosiate software developer, Quadloops Technologies, Ernakulam, Kerala": ["An assosiate software developer with expertise in python, Django and AngularJS and posses 1 year hands on experience.", " Developed websites and applications in django and AngularJS with different databases", "like PostgreSQL, SQLite3 and MongoDB.", "Worked in two different projects in Django. In one project (Schedox),", "worked at both front-end(AngularJS) and back-end(Django). ", "Second project (Faearch) mainly concentrated on Flask"], "Intern, Recursive labs, Thrissur, Kerala.": ["Did small projects in Python, Django and Flask with Pramode C.E ", "(programmer and consultant on Free and Open Source Software based technologies from Kerala) as mentor."]}, "Languages": ["Malayalam", "English", "Hindi"], "Extra- Curricular activities": ["Active member in FOSS community at GEC Sreekrishnapuram , Palakkad", "Event organizer of gaming competition in GHATECH 2011 , a tech fest organized by IEEE Student Branch."], "TechnicalSkills": {"Versioncontrol": "Revision control with git", "Web Technologies": "Javascript/HTML5/jQuery,AngularJS,Flask,Django", "Programming skills": "C,C++,Python", "Operating Systems": "Linux,Windows", "Database": "PostgreSQL,SQLite3,MongoDB"}, "Email": "haseebvp9@gmail.com", "Interests": ["Football", "Cricket", "Films", "Chess"], "My Blog Address": "http://geekyjumpz.blogspot.in", "name": "AbdulHaseebVP", "HobbyProjects": {"Huffman data compression": ["My attempt to show how to implement Lossless data compression or", "Huffman data compression algorithm using javascript."], "Blog app using Flask": ["A basic paint application using Javascript and HTML 5/canvas.", "Provides almost all simple basic paint functions.", "Web framework used is Django.The back end database is PostgreSQL.", "And also done in MongoDb/Nosql database"], "GraphAppusingDjango/HTML5": ["A basic Graph application for implementing Graph coloring algorithm using Javascript and HTML 5/canvas in Django.", "It is simple application that can show us how to use graph coloring in minimum cost."], "Paint app using Flask/HTML5": ["This is a simple paint app i created using javascript in HTML5 canvas which provides", " tools like pencil,line,rectangle,circle,brush,eraser etc.", "Flask is used as the web framework.Save option is provided which will store image data", " as JSON object.PostgreSQL database is used."], "Paint App using Django/HTML5": ["A basic paint application using Javascript and HTML 5/canvas. ", "Provides almostall simple basic paint functions.", " Web framework used is Django.The back end database is PostgreSQL.", "And also done in MongoDb/Nosql database"], "Lisp Interpreter in javascript": ["An attempt to show how to implement a subset of the scheme dialect of ", "Lisp using Javascript.To be exact it is a Javascript version of scheme ", "interpreter written by Peter norvig in python."]}, "Academic projects and Seminars": {"Seminar : XORs in The Air: Practical Wireless Network Coding": ["This report proposes COPE, a new architecture for wireless mesh networks. ", "In addition to forwarding packets, routers mix (i.e., code) packets from", " different sources to increase the information content of each transmission.", "We show that intelligently mixing packets increases network throughput. ", "Our design is rooted in the theory of network coding. Prior work on", "network coding is mainly theoretical and focuses on multicast traffic.", "This report aims to addresses the common case of unicast traffic, dynamic and potentially", "bursty flows, and practical issues facing the integration of network coding ", "in the current network stack."], "Main Project : Text Chunking In NLTK Integrated with Hadoop": ["Text chunking is recovering phrases constructed by the part-of-speech tags by finding ", "base noun phrases,finding verb groups, etc.Text chunking is used for ", "extracting information which can be used for keyword extraction,", "entity recognition,relation extraction,and other applicable areas.", " Text Chunking can be implemented by using NLTK;Natural Language Tool kit ,", "a tool kit used for Natural Language Processing.But the present problem with ", "NLTK is that it canâĂŹt handle massive anount of data as NLP ", "require a large set of data for analysing itself.", " The only solution to this problem is by cluster computing .", "Hadoop is an open source MapReduce framework.MapReduce style clustering is", " especially suited to processing large amounts of data.So in our project", " we are trying to implement a Text chunker in NLTK ;The NLTK is ", "such that it is integrated with Hadoop and its draw back of becoming slow ", "because of large amount of data is handled efficiently ."], "Mini Project : Implementation of map in Android using Bayesian Network": ["Aim of this project is to find shortest path between the source and destination places", "and also the minimum distance between the two, without using any of the functions of", "the network providers and hencewithout spending the money.", "The shortest path between the two places will be shown on a map on ", " which the user can see the intermediate places comes in that path. ", "A line on the map will indicate the shortest path.Since the output of ", "the system is a map, user will be able to find out his path easily."]}, "My Github Repository": "https://github.com/Haseebvp", "Phone": "+91-9633438467", "Address": "Vellapully house – Palakkazhi, Alanallur2(po),Palakkad(dt),Kerala-678601", "Education": {"2006–2008": "Higher Secondary Education,GVHSS Karakurussi,Board of Higher Secondary Examination,Kerala,GPA–8.9.", "2005–2006": "Secondary School Education,SSLC,DBHS Thachampara,Board of Examina-tion,Kerala,GPA–8.1.", "2009–2013": "Bachler of Information Technology,University of Calicut,Kerala,GPA–6.0."}}